project/atropos-go/etcd_concurrent_read-master/master/e1/output/with_expensive_read/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                                  !   0.00%INFO: 2023/06/09 04:29:28 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/09 04:29:28 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 04:29:28 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9910 secs.
  Slowest:	0.0090 secs.
  Fastest:	0.0002 secs.
  Average:	0.0005 secs.
  Stddev:	0.0006 secs.
  Requests/sec:	100.0901

Response time histogram:
  0.0002 [1]	|
  0.0011 [898]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0019 [74]	|∎∎∎
  0.0028 [13]	|
  0.0037 [8]	|
  0.0046 [5]	|
  0.0055 [0]	|
  0.0064 [0]	|
  0.0072 [0]	|
  0.0081 [0]	|
  0.0090 [1]	|

Latency distribution:
  10% in 0.0002 secs.
  25% in 0.0003 secs.
  50% in 0.0004 secs.
  75% in 0.0005 secs.
  90% in 0.0011 secs.
  95% in 0.0017 secs.
  99% in 0.0029 secs.
  99.9% in 0.0090 secs.