project/atropos-go/etcd_concurrent_read-master/master/e1/output/with_expensive_read/expensive_read.log
bench with linearizable range
 0 / 30 B                                                                                                                                                    !   0.00%INFO: 2023/06/09 04:29:28 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/09 04:29:28 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 04:29:28 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 30 / 30 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 29s

Summary:
  Total:	29.0008 secs.
  Slowest:	0.0032 secs.
  Fastest:	0.0003 secs.
  Average:	0.0010 secs.
  Stddev:	0.0007 secs.
  Requests/sec:	1.0345

Response time histogram:
  0.0003 [1]	|∎∎∎
  0.0006 [12]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0009 [1]	|∎∎∎
  0.0012 [3]	|∎∎∎∎∎∎∎∎∎∎
  0.0015 [4]	|∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0017 [7]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0020 [1]	|∎∎∎
  0.0023 [0]	|
  0.0026 [0]	|
  0.0029 [0]	|
  0.0032 [1]	|∎∎∎

Latency distribution:
  10% in 0.0004 secs.
  25% in 0.0004 secs.
  50% in 0.0011 secs.
  75% in 0.0016 secs.
  90% in 0.0017 secs.
  95% in 0.0032 secs.